app/Controllers/Home.php

    public function index()
    {
        $tempat = $this->Tempat->get();
---
SELECT *
FROM `tempat`

    public function addTempat()
    {
        $data = [
            'nama' => $this->request->getPost('nama'),
            'longitude' => $this->request->getPost('longitude'),
            'latitude' => $this->request->getPost('latitude')
        ];

        $this->Tempat->insert($data);
---
INSERT INTO `tempat` (`nama`, `longitude`, `latitude`) VALUES ('Botani Square Bogor', '-6.60107700074166', '106.80708541258757')